[Demo_Maya_ep3_1 GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=2136,Y=-2193,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[4]=(Actor=CHARACTER,Command=POP,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',Vec=(X=2136,Y=-2383,Z=80),VecSub=(X=90,Y=0,Z=0),CId=258)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0100_lp_Stand",Number=9,CId=258,Bit=4)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Campus_2.GG2_AMB_Campus_2_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep3_1.GG2_V_Maya_ep3_1_001_Cue',Name="ホーダイ君人形")
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[13]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[14]=(Actor=WINDOW,Command=EXIT)
DemoScripts[15]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=-90,Y=-35,Z=0),SecTime=0.5)
DemoScripts[16]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[17]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-35,Z=0),SecTime=)
DemoScripts[18]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[19]=(Actor=WINDOW,Command=SET)
DemoScripts[20]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[21]=(Actor=WINDOW,Command=EXIT)
DemoScripts[22]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=2136,Y=-2243,Z=80),SecTime=0.3)
DemoScripts[23]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=-90,Y=-27,Z=0),SecTime=0.3)
DemoScripts[24]=(Actor=SYSTEM,Command=WAIT,SecTime=0.3)
DemoScripts[25]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=2136,Y=-2243,Z=80),SecTime=)
DemoScripts[26]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=-90,Y=-27,Z=0),SecTime=)
DemoScripts[27]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0102_fx_Stand2Talk",Number=9,CId=258,Bit=0)
DemoScripts[28]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0200_lp_Talk",Number=10,CId=258)
DemoScripts[29]=(Actor=WINDOW,Command=SET)
DemoScripts[30]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep3_1.GG2_V_Maya_ep3_1_003_Cue',Name="ホーダイ君人形")
DemoScripts[31]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[32]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[33]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0201_fx_Talk2Stand",Number=9,CId=258,Bit=0)
DemoScripts[34]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0100_lp_Stand",Number=10,CId=258)
DemoScripts[35]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep3_1.GG2_V_Maya_ep3_1_004_Cue',Name="")
DemoScripts[36]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[37]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[38]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[39]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0102_fx_Stand2Talk",Number=9,CId=258,Bit=0)
DemoScripts[40]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0200_lp_Talk",Number=10,CId=258)
DemoScripts[41]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Maya_ep3_1.GG2_V_Maya_ep3_1_006_Cue',Name="ホーダイ君人形")
DemoScripts[42]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[43]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[44]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0201_fx_Talk2Stand",Number=9,CId=258,Bit=0)
DemoScripts[45]=(Actor=CHARACTER,Command=ACTION,Name="ホーダイ君人形",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.69_KAMIZONO_SHINOBU',motionName[0]="hd_DM_0100_lp_Stand",Number=10,CId=258)
DemoScripts[46]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[47]=(Actor=WINDOW,Command=EXIT)
DemoScripts[48]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[49]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[50]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[51]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[52]=(Actor=SYSTEM,Command=END)

[Select_Maya_ep3_1 GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=50),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=55),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=FASHION,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=EROTIC,ParamNum=50))
Selects[1]=(Label="SELECT01",SelectNumber=4,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=50),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=55),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=FASHION,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=EROTIC,ParamNum=50))
Selects[2]=(Label="SELECT02",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=50),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=55),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=FASHION,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=EROTIC,ParamNum=50))

[Text_Maya_ep3_1 GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大小子",Text="\"有留言唷! 有留言唷!\"")

Texts[1]=(Label="TEXT02",Name="峯大",Text="這是小真夜的/n傳訊人偶?")

Texts[2]=(Label="TEXT03",Name="峯大小子",Text="\"小真夜在找你唷!/n小真夜在找你唷!\"")

Texts[3]=(Label="TEXT04",Name="艾可蘿",Text="原來如此,是這樣用的啊.")

Texts[4]=(Label="TEXT05",Name="峯大",Text="......話說,不知道關鍵的地點/n就沒意義了啊,小真夜......")

Texts[5]=(Label="TEXT06",Name="峯大小子",Text="\"Let's go--\"")

Texts[6]=(Label="TEXT07",Name="峯大",Text="總之就老實地邊走邊找吧.")

Texts[7]=(Label="",Name="",Text="")

Texts[8]=(Label="",Name="",Text="")


